In [4]:
import pandas as pd

In [6]:
a=pd.read_csv("ranom.csv")

In [7]:
a.head()

,name,phone,email,address,postalZip,region,numberrange,country,currency
0,Leandra Wiley,(985) 619-1145,morbi.tristique@aol.net,185 Velit Avenue,741552,Rogaland,1,Austria,$14.26
1,Demetrius Walters,(751) 122-4195,et.euismod@outlook.org,959-3029 Pede Rd.,187158,Central Sulawesi,7,Colombia,$78.72
2,Kibo Fox,1-478-833-8145,enim.mi.tempor@icloud.org,807-7840 Luctus Rd.,561193,Veracruz,2,France,$17.29
3,Nora Poole,(518) 346-8444,massa.integer@outlook.org,Ap #634-7077 Arcu. Road,02-772,Alsace,3,France,$39.44
4,Silas Francis,1-575-591-8431,eu.sem@yahoo.net,Ap #935-1910 Ac Street,53792,Xīběi,2,Indonesia,$48.61

In [8]:
a.columns

Index(['name', 'phone', 'email', 'address', 'postalZip', 'region',
       'numberrange', 'country', 'currency'],
      dtype='object')

In [10]:
a.columns.values

array(['name', 'phone', 'email', 'address', 'postalZip', 'region',
       'numberrange', 'country', 'currency'], dtype=object)

In [11]:
a.columns.tolist()

['name',
 'phone',
 'email',
 'address',
 'postalZip',
 'region',
 'numberrange',
 'country',
 'currency']

In [12]:
a.columns.view()

Index(['name', 'phone', 'email', 'address', 'postalZip', 'region',
       'numberrange', 'country', 'currency'],
      dtype='object')

In [14]:
a.columns.to_series()

name                  name
phone                phone
email                email
address            address
postalZip        postalZip
region              region
numberrange    numberrange
country            country
currency          currency
dtype: object

In [15]:
a.columns.to_frame()

                       0
name                name
phone              phone
email              email
address          address
postalZip      postalZip
region            region
numberrange  numberrange
country          country
currency        currency

In [16]:
a.columns.duplicated()

array([False, False, False, False, False, False, False, False, False])

In [18]:
a.columns.str.upper()

Index(['NAME', 'PHONE', 'EMAIL', 'ADDRESS', 'POSTALZIP', 'REGION',
       'NUMBERRANGE', 'COUNTRY', 'CURRENCY'],
      dtype='object')

In [19]:
a.columns.str.title()

Index(['Name', 'Phone', 'Email', 'Address', 'Postalzip', 'Region',
       'Numberrange', 'Country', 'Currency'],
      dtype='object')

In [22]:
#a.columns.str.replace("","_")

In [29]:
a.rename(columns={'Region':'Country'},inplace=True)
a.head()

,name,phone,email,address,postalZip,region,numberrange,country,currency
0,Leandra Wiley,(985) 619-1145,morbi.tristique@aol.net,185 Velit Avenue,741552,Rogaland,1,Austria,$14.26
1,Demetrius Walters,(751) 122-4195,et.euismod@outlook.org,959-3029 Pede Rd.,187158,Central Sulawesi,7,Colombia,$78.72
2,Kibo Fox,1-478-833-8145,enim.mi.tempor@icloud.org,807-7840 Luctus Rd.,561193,Veracruz,2,France,$17.29
3,Nora Poole,(518) 346-8444,massa.integer@outlook.org,Ap #634-7077 Arcu. Road,02-772,Alsace,3,France,$39.44
4,Silas Francis,1-575-591-8431,eu.sem@yahoo.net,Ap #935-1910 Ac Street,53792,Xīběi,2,Indonesia,$48.61

In [37]:
a.filter(like='name').columns
a.columns

Index(['name', 'phone', 'email', 'address', 'postalZip', 'region',
       'numberrange', 'country', 'currency'],
      dtype='object')

In [46]:
a.rename(columns={'name':'Full_name'},inplace=True)

In [48]:
a.Full_name

0        Leandra Wiley
1    Demetrius Walters
2             Kibo Fox
3           Nora Poole
4        Silas Francis
5    George Livingston
6        Ifeoma Franks
7          Sybil Avila
8      Channing Walker
9         Thomas Carey
Name: Full_name, dtype: object

In [50]:
a.Full_name.str.split(" ")

0        [Leandra, Wiley]
1    [Demetrius, Walters]
2             [Kibo, Fox]
3           [Nora, Poole]
4        [Silas, Francis]
5    [George, Livingston]
6        [Ifeoma, Franks]
7          [Sybil, Avila]
8      [Channing, Walker]
9         [Thomas, Carey]
Name: Full_name, dtype: object

In [54]:
a['firstname']=a.Full_name.str.split(" ").str.get(0)
a.firstname

0      Leandra
1    Demetrius
2         Kibo
3         Nora
4        Silas
5       George
6       Ifeoma
7        Sybil
8     Channing
9       Thomas
Name: firstname, dtype: object

In [55]:
a.Full_name.str.split(" ",n=1,expand=True)

           0           1
0    Leandra       Wiley
1  Demetrius     Walters
2       Kibo         Fox
3       Nora       Poole
4      Silas     Francis
5     George  Livingston
6     Ifeoma      Franks
7      Sybil       Avila
8   Channing      Walker
9     Thomas       Carey

In [57]:
a.isnull()

,Full_name,phone,email,address,postalZip,region,numberrange,country,currency,firstname
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,False,False,False

In [59]:
a.isnull().any()
a.isnull().sum()

Full_name      0
phone          0
email          0
address        0
postalZip      0
region         0
numberrange    0
country        0
currency       0
firstname      0
dtype: int64